app/Controllers/UIController.php

    public function insertsubscribe()
    {
        $data=[
            'email'=>$this->request->getVar('email'),
        ];

       // dd($data);
        $model = new \App\Models\SubscribeModel();
        $Model = model('SubscribeModel');
        $model->insert($data);
---
INSERT INTO `subscribe` (`email`) VALUES ('bhikajichaskar@gmail.com')