app/Controllers/UserController.php

SELECT *
FROM `cloudinfra`
---
    public function oraclecloudinfra()
    {
        helper('filesystem');
        $model = new \App\Models\CloudInfraModel();
        $Model = model('CloudInfraModel');
        $data['detail']=$model->findAll();